# GroupBY

O método GroupBY permite agrupar linhas de dados em conjunto e chamar funções agregadas}

In [2]:
## Importando o pandas
import pandas as pd

In [3]:
data= {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Nome':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Venda':[200,123,340,124,243,350]
      }

In [4]:
## Convertendo a variavél 'data' um dataframe
df = pd.DataFrame(data)

In [5]:
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    123
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

**Agora, você pode usar o método .group by () para agrupar as linhas em conjunto com base em um nome de coluna. Por exemplo, vamos agrupar com base na empresa. Isso criará um objeto DataFrameGroupBy:**

In [6]:
df.groupby('Empresa')

In [7]:
## Atribuindo a uma variavel
por_empresa = df.groupby('Empresa')

In [8]:
## Calculando a média de venda por empresa
por_empresa.mean()

         Venda
Empresa
FB       296.5
GOOG     161.5
MSFT     232.0

In [11]:
## calculando o desvio padrão
por_empresa.std()

              Venda
Empresa
FB        75.660426
GOOG      54.447222
MSFT     152.735065

In [14]:
## Pegando o valor mínimo
por_empresa.min()

            Nome  Venda
Empresa
FB          Carl    243
GOOG     Charlie    123
MSFT         Amy    124

In [15]:
## Pegando o valor máximo
por_empresa.max()

            Nome  Venda
Empresa
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [16]:
## fazendo a contagem
por_empresa.count()

         Nome  Venda
Empresa
FB          2      2
GOOG        2      2
MSFT        2      2

In [19]:
## o describe() vai mostrar tudo junto a média, mínimo, máxima, desvio padrão...
por_empresa.describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  161.5   54.447222  123.0  142.25  161.5  180.75  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0